{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "bos_token_id": 0,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attention_multiplier": 0.015625,
  "eos_token_id": 0,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "max_position_embeddings": 131072,
  "model_type": "llama",
  "num_attention_heads": 16,
  "num_key_value_heads": 8,
  "num_hidden_layers": 1,
  "pad_token_id": 0,
  "rms_norm_eps": 1e-06,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.47.0",
  "use_cache": true,
  "vocab_size": 49155,
  "draft_vocab_size": 32000,
  "embedding_multiplier": 12.0,
  "residual_multiplier": 0.22,
  "logits_scaling": 6.0,
  "rope_theta": 1500000.0,
  "rope_scaling": null
}
